valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxCpu_reg.h
/** \brief E028, CPUx Safety Protection SPR Region Write Access Enable Register A2 */
#define CPU0_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF880E028u)
/** Alias (User Manual Name) for CPU0_RGN2_ACCENA.
* To use register names with standard convension, please use CPU0_RGN2_ACCENA.
*/
#define CPU0_SPR_SPROT_RGNACCENA2_W (CPU0_RGN2_ACCENA)

/** \brief E02C, CPUx Safety Protection SPR Region Write Access Enable Register B2 */
#define CPU0_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF880E02Cu)
/** Alias (User Manual Name) for CPU0_RGN2_ACCENB.
* To use register names with standard convension, please use CPU0_RGN2_ACCENB.
*/
#define CPU0_SPR_SPROT_RGNACCENB2_W (CPU0_RGN2_ACCENB)

/** \brief E030, CPUx Safety Protection SPR Region Lower Address Register 3 */
#define CPU0_RGN3_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF880E030u)
/** Alias (User Manual Name) for CPU0_RGN3_LA.
* To use register names with standard convension, please use CPU0_RGN3_LA.
*/
#define CPU0_SPR_SPROT_RGNLA3 (CPU0_RGN3_LA)

/** \brief E034, CPUx Safety Protection SPR Region Upper Address Register 3 */
#define CPU0_RGN3_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF880E034u)
/** Alias (User Manual Name) for CPU0_RGN3_UA.
* To use register names with standard convension, please use CPU0_RGN3_UA.
*/
#define CPU0_SPR_SPROT_RGNUA3 (CPU0_RGN3_UA)

/** \brief E038, CPUx Safety Protection SPR Region Write Access Enable Register A3 */
#define CPU0_RGN3_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF880E038u)
/** Alias (User Manual Name) for CPU0_RGN3_ACCENA.
* To use register names with standard convension, please use CPU0_RGN3_ACCENA.
*/
#define CPU0_SPR_SPROT_RGNACCENA3_W (CPU0_RGN3_ACCENA)

/** \brief E03C, CPUx Safety Protection SPR Region Write Access Enable Register B3 */
#define CPU0_RGN3_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF880E03Cu)
/** Alias (User Manual Name) for CPU0_RGN3_ACCENB.
* To use register names with standard convension, please use CPU0_RGN3_ACCENB.
*/
#define CPU0_SPR_SPROT_RGNACCENB3_W (CPU0_RGN3_ACCENB)

/** \brief E040, CPUx Safety Protection SPR Region Lower Address Register 4 */
#define CPU0_RGN4_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF880E040u)
/** Alias (User Manual Name) for CPU0_RGN4_LA.
* To use register names with standard convension, please use CPU0_RGN4_LA.
*/
#define CPU0_SPR_SPROT_RGNLA4 (CPU0_RGN4_LA)

/** \brief E044, CPUx Safety Protection SPR Region Upper Address Register 4 */
#define CPU0_RGN4_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF880E044u)
/** Alias (User Manual Name) for CPU0_RGN4_UA.
* To use register names with standard convension, please use CPU0_RGN4_UA.
*/
#define CPU0_SPR_SPROT_RGNUA4 (CPU0_RGN4_UA)

/** \brief E048, CPUx Safety Protection SPR Region Write Access Enable Register A4 */
#define CPU0_RGN4_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF880E048u)
/** Alias (User Manual Name) for CPU0_RGN4_ACCENA.
* To use register names with standard convension, please use CPU0_RGN4_ACCENA.
*/
#define CPU0_SPR_SPROT_RGNACCENA4_W (CPU0_RGN4_ACCENA)

/** \brief E04C, CPUx Safety Protection SPR Region Write Access Enable Register B4 */
#define CPU0_RGN4_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF880E04Cu)
/** Alias (User Manual Name) for CPU0_RGN4_ACCENB.
* To use register names with standard convension, please use CPU0_RGN4_ACCENB.
*/
#define CPU0_SPR_SPROT_RGNACCENB4_W (CPU0_RGN4_ACCENB)

/** \brief E050, CPUx Safety Protection SPR Region Lower Address Register 5 */
#define CPU0_RGN5_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF880E050u)
/** Alias (User Manual Name) for CPU0_RGN5_LA.
* To use register names with standard convension, please use CPU0_RGN5_LA.
*/
#define CPU0_SPR_SPROT_RGNLA5 (CPU0_RGN5_LA)

/** \brief E054, CPUx Safety Protection SPR Region Upper Address Register 5 */
#define CPU0_RGN5_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF880E054u)
/** Alias (User Manual Name) for CPU0_RGN5_UA.
* To use register names with standard convension, please use CPU0_RGN5_UA.
*/
#define CPU0_SPR_SPROT_RGNUA5 (CPU0_RGN5_UA)

/** \brief E058, CPUx Safety Protection SPR Region Write Access Enable Register A5 */
#define CPU0_RGN5_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF880E058u)
/** Alias (User Manual Name) for CPU0_RGN5_ACCENA.
* To use register names with standard convension, please use CPU0_RGN5_ACCENA.
*/
#define CPU0_SPR_SPROT_RGNACCENA5_W (CPU0_RGN5_ACCENA)

/** \brief E05C, CPUx Safety Protection SPR Region Write Access Enable Register B5 */
#define CPU0_RGN5_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF880E05Cu)
/** Alias (User Manual Name) for CPU0_RGN5_ACCENB.
* To use register names with standard convension, please use CPU0_RGN5_ACCENB.
*/
#define CPU0_SPR_SPROT_RGNACCENB5_W (CPU0_RGN5_ACCENB)

/** \brief E060, CPUx Safety Protection SPR Region Lower Address Register 6 */
#define CPU0_RGN6_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF880E060u)
/** Alias (User Manual Name) for CPU0_RGN6_LA.
* To use register names with standard convension, please use CPU0_RGN6_LA.
*/
#define CPU0_SPR_SPROT_RGNLA6 (CPU0_RGN6_LA)

/** \brief E064, CPUx Safety Protection SPR Region Upper Address Register 6 */
#define CPU0_RGN6_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF880E064u)
/** Alias (User Manual Name) for CPU0_RGN6_UA.
* To use register names with standard convension, please use CPU0_RGN6_UA.
*/
#define CPU0_SPR_SPROT_RGNUA6 (CPU0_RGN6_UA)

/** \brief E068, CPUx Safety Protection SPR Region Write Access Enable Register A6 */
#define CPU0_RGN6_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF880E068u)
/** Alias (User Manual Name) for CPU0_RGN6_ACCENA.
* To use register names with standard convension, please use CPU0_RGN6_ACCENA.
*/
#define CPU0_SPR_SPROT_RGNACCENA6_W (CPU0_RGN6_ACCENA)

/** \brief E06C, CPUx Safety Protection SPR Region Write Access Enable Register B6 */
#define CPU0_RGN6_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF880E06Cu)
/** Alias (User Manual Name) for CPU0_RGN6_ACCENB.
* To use register names with standard convension, please use CPU0_RGN6_ACCENB.
*/
#define CPU0_SPR_SPROT_RGNACCENB6_W (CPU0_RGN6_ACCENB)

/** \brief E070, CPUx Safety Protection SPR Region Lower Address Register 7 */
#define CPU0_RGN7_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF880E070u)
/** Alias (User Manual Name) for CPU0_RGN7_LA.
* To use register names with standard convension, please use CPU0_RGN7_LA.
*/
#define CPU0_SPR_SPROT_RGNLA7 (CPU0_RGN7_LA)

/** \brief E074, CPUx Safety Protection SPR Region Upper Address Register 7 */
#define CPU0_RGN7_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF880E074u)
/** Alias (User Manual Name) for CPU0_RGN7_UA.
* To use register names with standard convension, please use CPU0_RGN7_UA.
*/
#define CPU0_SPR_SPROT_RGNUA7 (CPU0_RGN7_UA)

/** \brief E078, CPUx Safety Protection SPR Region Write Access Enable Register A7 */
#define CPU0_RGN7_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF880E078u)
/** Alias (User Manual Name) for CPU0_RGN7_ACCENA.
* To use register names with standard convension, please use CPU0_RGN7_ACCENA.
*/
#define CPU0_SPR_SPROT_RGNACCENA7_W (CPU0_RGN7_ACCENA)

